{
    "architectures": [
      "SwinForImageClassification"
    ],
    "attention_probs_dropout_prob": 0.0,
    "depths": [
      2,
      2,
      6,
      2
    ],
    "drop_path_rate": 0.1,
    "embed_dim": 96,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "id2label": null,
    "image_size": 224,
    "initializer_range": 0.02,
    "label2id": null,
    "layer_norm_eps": 1e-05,
    "mlp_ratio": 4.0,
    "model_type": "swin",
    "num_channels": 3,
    "num_heads": [
      3,
      6,
      12,
      24
    ],
    "patch_size": 4,
    "path_norm": true,
    "qkv_bias": true,
    "torch_dtype": "float32",
    "transformers_version": "4.16.0.dev0",
    "use_absolute_embeddings": false,
    "window_size": 7
  }
  