{
    "architectures": [
      "DinatForImageClassification"
    ],
    "attention_probs_dropout_prob": 0.0,
    "depths": [
      3,
      4,
      18,
      5
    ],
    "dilations": [
      [
        1,
        8,
        1
      ],
      [
        1,
        4,
        1,
        4
      ],
      [
        1,
        2,
        1,
        2,
        1,
        2,
        1,
        2,
        1,
        2,
        1,
        2,
        1,
        2,
        1,
        2,
        1,
        2
      ],
      [
        1,
        1,
        1,
        1,
        1
      ]
    ],
    "drop_path_rate": 0.2,
    "embed_dim": 64,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 512,
    "id2label": null,
    "initializer_range": 0.02,
    "kernel_size": 7,
    "label2id": null,
    "layer_norm_eps": 1e-05,
    "layer_scale_init_value": 0.0,
    "mlp_ratio": 3.0,
    "model_type": "dinat",
    "num_channels": 3,
    "num_heads": [
      2,
      4,
      8,
      16
    ],
    "num_layers": 4,
    "patch_size": 4,
    "path_norm": true,
    "qkv_bias": true,
    "torch_dtype": "float32",
    "transformers_version": "4.25.0.dev0"
  }
  