{
    "_commit_hash": null,
    "activation_function": "relu",
    "architectures": [
      "CustomMask2FormerForUniversalSegmentation"
    ],
    "backbone_config": null,
    "class_weight": 2.0,
    "common_stride": 4,
    "decoder_layers": 10,
    "dice_weight": 5.0,
    "dim_feedforward": 2048,
    "dropout": 0.0,
    "encoder_feedforward_dim": 1024,
    "encoder_layers": 6,
    "enforce_input_proj": false,
    "enforce_input_projection": false,
    "feature_size": 256,
    "feature_strides": [
      4,
      8,
      16,
      32
    ],
    "hidden_dim": 256,
    "id2label": null,
    "ignore_value": 255,
    "importance_sample_ratio": 0.75,
    "init_std": 0.02,
    "init_xavier_std": 1.0,
    "label2id": null,
    "mask_feature_size": 256,
    "mask_weight": 5.0,
    "model_type": "custom_mask2former",
    "no_object_weight": 0.1,
    "num_attention_heads": 8,
    "num_hidden_layers": 10,
    "num_queries": 100,
    "output_auxiliary_logits": null,
    "oversample_ratio": 3.0,
    "pre_norm": false,
    "torch_dtype": "float32",
    "train_num_points": 12544,
    "transformers_version": null,
    "use_auxiliary_loss": true
  }
  