{
    "architectures": [
      "ResNetForImageClassification"
    ],
    "depths": [
      2,
      2,
      2,
      2
    ],
    "drop_path_rate": 0.0,
    "downsample_in_first_stage": false,
    "embedding_size": 64,
    "hidden_act": "relu",
    "hidden_sizes": [
      64,
      128,
      256,
      512
    ],
    "id2label": null,
    "label2id": null,
    "layer_type": "basic",
    "model_type": "resnet",
    "num_channels": 3,
    "torch_dtype": "float32",
    "transformers_version": "4.18.0.dev0"
  }
  