{
    "architectures": [
      "ConvNextV2ForImageClassification"
    ],
    "depths": [
      3,
      3,
      9,
      3
    ],
    "drop_path_rate": 0.0,
    "hidden_act": "gelu",
    "hidden_sizes": [
      96,
      192,
      384,
      768
    ],
    "id2label": null,
    "image_size": 224,
    "initializer_range": 0.02,
    "label2id": null,
    "layer_norm_eps": 1e-12,
    "model_type": "convnextv2",
    "num_channels": 3,
    "num_stages": 4,
    "out_features": null,
    "patch_size": 4,
    "stage_names": [
      "stem",
      "stage1",
      "stage2",
      "stage3",
      "stage4"
    ],
    "torch_dtype": "float32",
    "transformers_version": "4.27.0.dev0"
  }
  