{
  "architectures": [
    "FocalNetForImageClassification"
  ],
  "depths": [
    2,
    2,
    6,
    2
  ],
  "drop_path_rate": 0.1,
  "embed_dim": 96,
  "encoder_stride": 32,
  "focal_levels": [
    2,
    2,
    2,
    2
  ],
  "focal_windows": [
    3,
    3,
    3,
    3
  ],
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    192,
    384,
    768,
    768
  ],
  "image_size": 224,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-05,
  "layerscale_value": 0.0001,
  "mlp_ratio": 4.0,
  "model_type": "focalnet",
  "normalize_modulator": false,
  "num_channels": 3,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.29.2",
  "use_conv_embed": false,
  "use_layerscale": false,
  "use_post_layernorm": false,
  "use_post_layernorm_in_modulation": false
}
